mttarvina/dsPIC33CK_Template/dspic33ck_lib_mttarvina/dspic33ck_analog.c
/* 
 * File:            dspic33ck_analog.c
 * Device:          dsPIC33CK256MP202
 * Author:          Tarvs' Hobbytronics (mttarvina), email: mttarvina@gmail.com
 * Description:     This is the source code for DAC and DAC related routines
 */


#include <xc.h>
#include "dspic33ck_analog.h"


// *****************************************************************************
// SCCP2 Routines
//
// - can used by adc as trigger at constant rate
//
// *****************************************************************************

static SCCP2_TMR_OBJ sccp2_obj;


void SCCP2_Initialize(void) {
    
    //    CCPI: CCP2 Capture/Compare Event
    //    Priority: 1
    IPC5bits.CCP2IP = 1;
    //    CCTI: CCP2 Timer Event
    //    Priority: 1
    IPC6bits.CCT2IP = 1;
        
    // CCPON disabled; MOD 16-Bit/32-Bit Timer;
    // CCSEL disabled; CCPSIDL disabled; T32 16 Bit;
    // CCPSLP disabled; TMRPS 1:1; CLKSEL FOSC/2; TMRSYNC disabled;
        
    CCP2CON1L = (0x00 & 0x7FFF);                                                //Disabling CCPON bit
    CCP2CON1H = 0x00;                                                           //RTRGEN disabled; ALTSYNC disabled; ONESHOT disabled; TRIGEN disabled; OPS Each Time Base Period Match; SYNC None; OPSSRC Timer Interrupt Event; 
    CCP2CON2L = 0x00;                                                           //ASDGM disabled; SSDG disabled; ASDG 0; PWMRSEN disabled;
    CCP2CON2H = 0x00;                                                           //ICGSM Level-Sensitive mode; ICSEL IC2; AUXOUT Disabled; OCAEN disabled; OENSYNC disabled;
    CCP2CON3H = 0x00;                                                           //OETRIG disabled; OSCNT None; POLACE disabled; PSSACE Tri-state;
    CCP2STATL = 0x00;                                                           //ICDIS disabled; SCEVT disabled; TRSET disabled; ICOV disabled; ASEVT disabled; ICGARM disabled; TRCLR disabled;
    CCP2TMRL = 0x00;                                                            //TMR 0;
    CCP2TMRH = 0x00;                                                            //TMR 0;
    
    if (CLOCK_SystemFrequencyGet() == _8MHZ) {
        CCP2PRL = 0x4F;
    }
    else if (CLOCK_SystemFrequencyGet() == _16MHZ) {
        CCP2PRL = 0x9F;
    }
    else if (CLOCK_SystemFrequencyGet() == _20MHZ) {
        CCP2PRL = 0xC7;
    }
    else if (CLOCK_SystemFrequencyGet() == _50MHZ) {
        CCP2PRL = 0x1F3;
    }
    else if (CLOCK_SystemFrequencyGet() == _100MHZ) {
        CCP2PRL = 0x3E7;
    }    
    
    
    CCP2PRH = 0x00;                                                             //PR 0;
    CCP2RA = 0x00;                                                              //CMP 0;
    CCP2RB = 0x00;                                                              //CMP 0;
    CCP2BUFL = 0x00;                                                            //BUF 0;
    CCP2BUFH = 0x00;                                                            //BUF 0
         
    SCCP2_Start();
}


void SCCP2_Start( void ) {
    sccp2_obj.state = false;

    IFS1bits.CCP2IF = false;
    IFS1bits.CCT2IF = false;
    
    IEC1bits.CCP2IE = true;                                                     // Enabling SCCP2 interrupt.
    IEC1bits.CCT2IE = true;                                                     // Enabling SCCP2 interrupt.
    
    CCP2CON1Lbits.CCPON = true;
}


void SCCP2_Stop( void ) {
    CCP2CON1Lbits.CCPON = false;
}


void SCCP2_SetSamplingPeriod( uint16_t _period_us ) {
    
    if (CLOCK_SystemFrequencyGet() == _8MHZ) {
        sccp2_obj.pr = _period_us * 4;
    }
    else if (CLOCK_SystemFrequencyGet() == _16MHZ) {
        sccp2_obj.pr = _period_us * 8;
    }
    else if (CLOCK_SystemFrequencyGet() == _20MHZ) {
        sccp2_obj.pr = _period_us * 10;
    }
    else if (CLOCK_SystemFrequencyGet() == _50MHZ) {
        sccp2_obj.pr = _period_us * 25;
    }
    else if (CLOCK_SystemFrequencyGet() == _100MHZ) {
        sccp2_obj.pr = _period_us * 50;
    }    

    SCCP2_Stop();
    CCP2PRL = sccp2_obj.pr - 1;
    SCCP2_Start();
}

bool SCCP2_Triggered( void ) {
    if(sccp2_obj.state) {
        sccp2_obj.state = false;
        return true;
    }
    else {
        return false;
    }
}

void __attribute__ ( ( interrupt, no_auto_psv ) ) _CCT2Interrupt ( void ) {
    sccp2_obj.state = true;
    IFS1bits.CCT2IF = false;
}



// *****************************************************************************
// ADC1 Routines
//
//
//
// *****************************************************************************

static ADC1_OBJ adc1_obj;


void ADC1_Initialize ( void ) {

    if (ADC1_USES_INTERRUPT) {
        //    ADCI: ADC Global Interrupt
        //    Priority: 2
        IPC22bits.ADCIP = 1;
        //    ADCAN0: ADC AN0 Convert Done
        //    Priority: 2
        IPC22bits.ADCAN0IP = 1;
    }

    // ADSIDL disabled; ADON enabled; 
    ADCON1L = 0x0000;                                                           // Disabling ADON bit
    ADCON1H = 0x60;                                                             // FORM Integer; SHRRES 12-bit resolution;

    ADCON2L = 0x00;                                                             // Shared ADC Core Input CLK Divider, SHRADCS = 2;
                                                                                // 1 TADCORE = 2 Fosc CLK period
                                                                                // PTGEN disabled; REFCIE disabled; SHREISEL Early interrupt is generated 1 TADCORE clock prior to data being ready; REFERCIE disabled; EIEN disabled;
    
    ADCON2H = 0x00;                                                             // Shared ADC Core Sample Time, SHRSAMC = 2 TADCORE;
                                                                                // Shared ADC Core Sample Time = 4 Fosc CLK period

    ADCON3L = 0x00;                                                             // SWCTRG disabled; SHRSAMP disabled; SUSPEND disabled; SWLCTRG disabled; SUSPCIE disabled; CNVCHSEL AN0; REFSEL disabled; 
    
