mttarvina/dsPIC33CK_Template/dspic33ck_lib_mttarvina/dspic33ck_analog.c
    return 0;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN0Interrupt ( void ) {
    //clear the channel_AN0 interrupt flag
    IFS5bits.ADCAN0IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN1Interrupt ( void ) {
    //clear the channel_AN1 interrupt flag
    IFS5bits.ADCAN1IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN2Interrupt ( void ) {
    //clear the channel_AN2 interrupt flag
    IFS5bits.ADCAN2IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN3Interrupt ( void ) {
    //clear the channel_AN3 interrupt flag
    IFS5bits.ADCAN3IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN4Interrupt ( void ) {
    //clear the channel_AN4 interrupt flag
    IFS5bits.ADCAN4IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN5Interrupt ( void ) {
    //clear the channel_AN5 interrupt flag
    IFS6bits.ADCAN5IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN6Interrupt ( void ) {
    //clear the channel_AN6 interrupt flag
    IFS6bits.ADCAN6IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN7Interrupt ( void ) {
    //clear the channel_AN6 interrupt flag
    IFS6bits.ADCAN7IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN8Interrupt ( void ) {
    //clear the channel_AN8 interrupt flag
    IFS6bits.ADCAN8IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN9Interrupt ( void ) {
    //clear the channel_AN9 interrupt flag
    IFS6bits.ADCAN9IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN10Interrupt ( void ) {
    //clear the channel_AN10 interrupt flag
    IFS6bits.ADCAN10IF = false;
}


void __attribute__ ( ( __interrupt__ , auto_psv, weak ) ) _ADCAN11Interrupt ( void ) {
    //clear the channel_AN11 interrupt flag
    IFS6bits.ADCAN11IF = false;
}


// *****************************************************************************
// CMP1/DAC Routines
//
//
//
// *****************************************************************************


void CMP1_Initialize( void ) {           

    // Disable the CMP module before the initialization
    CMP1_Disable();
	
	// Comparator Register settings
	DACCTRL1L = 0x40;                                                           //CLKDIV 1:1; DACON disabled; DACSIDL disabled; FCLKDIV 1:1; CLKSEL FVCO/2 - System VCO Clock; 
	DACCTRL2L = 0x55;                                                           //TMODTIME 85; 
	DACCTRL2H = 0x8A;                                                           //SSTIME 138; 
	DAC1CONH = 0x00;                                                            //TMCB 0; 
	DAC1CONL = 0x8200;                                                          //CMPPOL Non Inverted; HYSPOL Rising Edge; HYSSEL None; DACEN enabled; FLTREN disabled; CBE disabled; IRQM Interrupts are disabled; INSEL CMP1A; DACOEN enabled; 

	//Slope Settings
	SLP1CONH = 0x00;                                                            //HME disabled; PSE Negative; SLOPEN disabled; TWME disabled; 
	SLP1CONL = 0x00;                                                            //HCFSEL None; SLPSTRT None; SLPSTOPB None; SLPSTOPA None; 
	SLP1DAT = 0x00;                                                             //SLPDAT 0; 
	DAC1DATL = 0x00;                                                            //DACDATL 0; 
	DAC1DATH = 0x00;                                                            //DACDATH 0; 
    
    CMP1_Enable();
}


void CMP1_Enable( void ) {
    DACCTRL1Lbits.DACON = 1;
}


void CMP1_Disable( void ) {
    DACCTRL1Lbits.DACON = 0;
}


void DAC_SetValue( uint16_t _dacVal ) {
    DAC1DATH = _dacVal;
}


void CMP1_EnableDACOutput( void ) {
    DAC1CONLbits.DACOEN = 1;
}


void CMP1_DisableDACOutput( void ) {
    DAC1CONLbits.DACOEN = 0;
}


void DAC_Enable( void ) {
    _TRISA3 = false;                                                            // set RA3 as output
    CMP1_Initialize();
    CMP1_EnableDACOutput();
}